UniDsproc/UniDsproc/Tests/smev2.base.2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<SOAP-ENV:Header xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
	<SOAP-ENV:Body wsu:Id="body">
		<n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ MethodMsg.xsd" xmlns:chg="http://roskazna.ru/xsd/Charge" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n3="http://www.altova.com/samplexml/other-namespace" xmlns:pdrq="http://roskazna.ru/xsd/PGU_DataRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<smev:Message>
				<smev:Sender>
					<smev:Code>RPTR01001</smev:Code>
					<smev:Name>test</smev:Name>
				</smev:Sender>
				<smev:Recipient>
					<smev:Code>RKZN35001</smev:Code>
					<smev:Name>test</smev:Name>
				</smev:Recipient>
				<smev:Originator>
					<smev:Code>RPTR01001</smev:Code>
					<smev:Name>test</smev:Name>
				</smev:Originator>
				<smev:TypeCode>GFNC</smev:TypeCode>
				<smev:Status>REQUEST</smev:Status>
				<smev:Date>2013-02-02T01:02:03.0Z</smev:Date>
				<smev:ExchangeType>6</smev:ExchangeType>
			</smev:Message>
			<smev:MessageData>
				<smev:AppData>
					<unifo:exportData>
						<pdrq:DataRequest kind="PAYMENT">
							<PostBlock>
								<ID>999734B3-C118-44E7-828A-93BB0BA23F4A</ID>
								<TimeStamp>2013-10-31T01:02:03.0Z</TimeStamp>
								<SenderIdentifier>7707515984</SenderIdentifier>
							</PostBlock>
							<StartDate>2014-01-20T00:00:00+04:00</StartDate>
							<EndDate>2014-01-30T23:59:59+04:00</EndDate>
						</pdrq:DataRequest>
					</unifo:exportData>
				</smev:AppData>
			</smev:MessageData>
		</n1:UnifoTransferMsg>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>